# Titanic Dataset

### = Read In CSV...

** + Where did the data come from?**
- Harland & Wolff Heavy Industries, builders of the Titanic 

** + What information does this data represent?**
- The **rows** represent: Pasengers who were aboard the titanic.
- The **columns/features** represent: Attributes of each passenger.

** + What information do the feature labels represent?**
- **Survived**: Outcome of survival (0 = No; 1 = Yes)
- **Pclass**: Socio-economic class (1 = Upper class; 2 = Middle class; 3 = Lower class)
- **Name**: Name of passenger
- **Sex**: Sex of the passenger
- **Age**: Age of the passenger (Some entries contain `NaN`)
- **SibSp**: Number of siblings and spouses of the passenger aboard
- **Parch**: Number of parents and children of the passenger aboard
- **Ticket**: Ticket number of the passenger
- **Fare**: Fare paid by the passenger
- **Cabin** Cabin number of the passenger (Some entries contain `NaN`)
- **Embarked**: Port of embarkation of the passenger (C = Cherbourg; Q = Queenstown; S = Southampton)

In [1]:
import pandas as pd

df = pd.read_csv("titanic.csv")

df.head()

,Id,Name,Class,Sex,Age,Fare,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,7.2500,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,71.2833,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,7.9250,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,53.1000,1
4,5,"Allen, Mr. William Henry",3,male,35.0,8.0500,0

In [ ]:
import pandas as pd

train_all = pd.read_csv("titanic.csv")
# test_all = pd.read_csv("titanic.csv")
# validate_all = 

train_x = 
train_y = 

df.head()

### Regression Version

In [2]:
# drop unwanted columns
df = df.drop(['Id', 'Name'], axis=1)

# If 'any' values are missing in a row, then drop that row
df = df.dropna(how='any', axis=0)

print(df.shape)
df.head()

(714, 5)

   Class     Sex   Age     Fare  Survived
0      3    male  22.0   7.2500         0
1      1  female  38.0  71.2833         1
2      3  female  26.0   7.9250         1
3      1  female  35.0  53.1000         1
4      3    male  35.0   8.0500         0

In [3]:
# 300 training examples
train_all = df.iloc[0:300, :]
export = pd.DataFrame(train_all)
export.to_csv('titanic_train300.csv')

print(export.shape)
export.head()

(300, 5)

   Class     Sex   Age     Fare  Survived
0      3    male  22.0   7.2500         0
1      1  female  38.0  71.2833         1
2      3  female  26.0   7.9250         1
3      1  female  35.0  53.1000         1
4      3    male  35.0   8.0500         0

In [4]:
# 300 training examples
test_all = df.iloc[300:500, :]
export = pd.DataFrame(test_all)
export.to_csv('titanic_test_200.csv')

print(export.shape)
export.head()

(200, 5)

     Class     Sex   Age      Fare  Survived
376      3  female  22.0    7.2500         1
377      1    male  27.0  211.5000         0
378      3    male  20.0    4.0125         0
379      3    male  19.0    7.7750         0
380      1  female  42.0  227.5250         1

In [5]:
# 300 training examples
validate_all = df.iloc[500:700, :]
export = pd.DataFrame(validate_all)
export.to_csv('titanic_validate_200.csv')

print(export.shape)
export.head()

(200, 5)

     Class     Sex   Age    Fare  Survived
632      1    male  32.0  30.500         1
634      3  female   9.0  27.900         0
635      2  female  28.0  13.000         1
636      3    male  32.0   7.925         0
637      2    male  31.0  26.250         0